Repository: FigueredoMatheus/meu_site
Catalog: lib/l10n/app_*.arb
Languages: pt

# language
source: English
pt: Portuguese

# linkBar1
source: Home
pt: Início

# linkBar2
source: About Me
pt: Sobre mim

# linkBar3
source: Skills
pt: Habilidades

# linkBar4
source: Projects
pt: Projetos

# homeCardText
source: Front-end developer & Computer Engineering student.
pt: Desenvolvedor front-end & estudante de Engenharia de Computação

# aboutMe
source: I'm Matheus, born in the state of Piauí-BR, 24 years old, front-end developer and studying Computer Engineering (expected completion in 2023). I have 2 years of experience, having worked most of my career using the Flutter framework, but currently I'm also developing with ReactJs, Javascript, Bootstrap, HTML and CSS. My trajectory in programming began in 2014, through Pronatec (a federal government program), and since then I have been passionate about this area.
pt: Eu sou o Matheus, natural do estado do Piauí-BR, 24 anos, desenvolvedor front-end e cursando Engenharia de Computação (pretensão de conclusão em 2023). Tenho 2 anos de experiência, tendo trabalhado boa parte da minha carreira utilizando o framework Flutter, mas atualmente também estou desenvolvendo com ReactJs, Javascript, Bootstrap, HTML e CSS. Minha trajetória na programação teve início em 2014, através do Pronatec (programa do governo federal), e desde então sou apaixonado por essa área.

# project1
source: Development of an interactive book reader application for android using Flutter with Firebase (Auth, Cloud Firestore, Storage, Dynamic Links and Google Admob), login with Google, Facebook and Email. In addition, Scrum was used for teamwork and Git for version control.
pt: Desenvolvimento de um aplicativo leitor de livros interativos para android usando Flutter com Firebase (Auth, Cloud Firestore, Storage, Dynamic Links e Google Admob), possui login com Google, Facebook e Email. Além disso, foi utilizado o Scrum para trabalho em equipe e Git para controle de versões.

# project2
source: Website developed using Flutter with Firebase (Hosting, Cloud Firestore and Storage). Prototype using Figma and Git for version control.
pt: Website desenvolvido utilizando Flutter com Firebase (Hosting, Cloud Firestore e Storage). Prototipo utilizando Figma e Git para controle de versões.

# project3
source: App developed using Flutter about Ecological Footprint. It is shown what it is and it is also possible to calculate your Ecological Footprint. Git was used for version control.
pt: App desenvolvido utilizando Flutter sobre Pegada Ecológica. É mostrado o que é e também é possível fazer o cálculo da sua Pegada Ecológica. Foi utilizado Git para controle de versões.

# project4
source: Website developed using Flutter with Firebase (Hosting). Prototype using Figma and Git for version control.
pt: Website desenvolvido utilizando Flutter com Firebase (Hosting). Prototipo utilizando Figma e Git para controle de versões.

# project5
source: Application developed in Flutter to search for gifs. The app consumes the GIPHY API. You can search for gifs according to your choice, save gifs locally as favorites and view them in the 'Favorites' tab. Also you can share gifs with your friends :)
pt: Aplicativo desenvolvido em Flutter para busca de gifs. O app consome a API GIPHY. É possível buscar gifs de acordo com sua escolha, salvar localmente gifs como favoritos e vê-los na aba 'Favoritos'. Além disso, você pode compartilhar gifs com seus amigos :)

# imagesButtonText
source: Images
pt: Imagens

# footerText
source: copyright © 2022 Matheus Figueredo. All rights reserved
pt: copyright © 2022 Matheus Figueredo. Todos os direitos reservados.
